app/controllers/messages_controller.rb

  def index
    @message = Message.new
    @room = Room.find(params[:room_id])
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 2 LIMIT 1

  def create
    @room = Room.find(params[:room_id])
    @message = @room.messages.new(message_params)
    if @message.save
---
SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 2 LIMIT 1
INSERT INTO `messages` (`content`, `room_id`, `user_id`, `created_at`, `updated_at`) VALUES ('はじめまして', 2, 1, '2021-02-02 14:11:41.192590', '2021-02-02 14:11:41.192590')