app/controllers/users_controller.rb

UPDATE `users` SET `users`.`name` = 'yamatomato', `users`.`updated_at` = '2021-02-02 03:48:22.176870' WHERE `users`.`id` = 1
---
  def update
    if current_user.update(user_params)